{
  "_name_or_path": "/home/xiongming/PycharmProjects/PythonProject1_Qwen15_05B_Chat/XiaYu-VL_05B_model/model001/",
  "architectures": [
    "LlavaForConditionalGeneration"
  ],
  "ignore_index": -100,
  "image_seq_length": 576,
  "image_token_index": 151646,
  "model_type": "llava",
  "pad_token_id": 151643,
  "projector_hidden_act": "gelu",
  "text_config": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "/home/xiongming/Documents/Qwen1.5-0.5B-Chat",
    "architectures": [
      "Qwen2ForCausalLM"
    ],
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_size": 1024,
    "intermediate_size": 2816,
    "max_position_embeddings": 32768,
    "max_window_layers": 21,
    "model_type": "qwen2",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "num_key_value_heads": 16,
    "rope_theta": 1000000.0,
    "sliding_window": null,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "use_sliding_window": false,
    "vocab_size": 151936
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.47.0",
  "vision_config": {
    "_attn_implementation_autoset": true,
    "dropout": 0.0,
    "hidden_size": 1024,
    "image_size": 336,
    "intermediate_size": 4096,
    "model_type": "clip_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "patch_size": 14,
    "projection_dim": 768
  },
  "vision_feature_layer": -2,
  "vision_feature_select_strategy": "default"
}
